<style  type="text/css"> 
cool {
  width: 100px;
  height: 100px;
  background-color: red;
  position: relative;
  -webkit-animation-name: example; /* Safari 4.0 - 8.0 */
  -webkit-animation-duration: 4s; /* Safari 4.0 - 8.0 */
  -webkit-animation-iteration-count: infinite; /* Safari 4.0 - 8.0 */
  animation-name: example;
  animation-duration: 4s;
  animation-iteration-count: infinite;
}

/* Safari 4.0 - 8.0 */
@-webkit-keyframes example {
  0%   {background-color:red; left:0px; top:0px;}
  25%  {background-color:yellow; left:200px; top:0px;}
  50%  {background-color:blue; left:200px; top:200px;}
  75%  {background-color:green; left:0px; top:200px;}
  100% {background-color:red; left:0px; top:0px;}
}

/* Standard syntax */
@keyframes example {
  0%   {background-color:red; left:0px; top:0px;}
  25%  {background-color:yellow; left:200px; top:0px;}
  50%  {background-color:blue; left:200px; top:200px;}
  75%  {background-color:green; left:0px; top:200px;}
  100% {background-color:red; left:0px; top:0px;}
}
</style>

<b><center>
<span style="font-size: 24pt; line-height: 1.2">
COMS W4111: Introduction to Databases
</span>
</center></b>
</span><br>
<p>
<i><center>
<span style="font-size: 20pt; line-height: 1.2">
Lecture 6: <br>Relational Algebra, <br>(Some) Advanced ER Concepts, <br>(Some) Advanced SQL<br>
</span>
</center></i>

<u><span style="font-size: 24px;">Lecture Overview</span></u>
<br><br>
1. Relational Algebra<br><br>
1. Some Advanced ER Concepts:
    1. Specialization (Continued).
    2. Roles and Relationships
    3. Aggregation.
    4. Complex Attributes.
    5. Design Issues.<br><br>
1. Advanced SQL:
    1. JOIN: Details and Examples
    2. Authorization (and other security issues).
    3. Recursive Queries.

<u><span style="font-size: 24px;">Initialize Environment</span></u>
<br><br>

In [103]:
%load_ext sql
%sql mysql+pymysql://dbuser:dbuserdbuser@localhost/W4111

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

'Connected: dbuser@W4111'

# Relational Algebra

- Use PPT

- Use on-line calculator.

# Specialization

## Overview

- Use PPT

## Implementation

### Base Tables

```
/*
    Already ran the create statements and loaded data.
    Do not want to do again.
*/

CREATE TABLE `people_three` (
  `id` varchar(32) COLLATE utf8mb4_bin NOT NULL,
  `first_name` varchar(64) COLLATE utf8mb4_bin NOT NULL,
  `last_name` varchar(64) COLLATE utf8mb4_bin NOT NULL,
  `email` varchar(128) COLLATE utf8mb4_bin NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_bin;

CREATE TABLE `faculty_three` (
  `id` varchar(32) COLLATE utf8mb4_bin NOT NULL,
  `title` varchar(128) COLLATE utf8mb4_bin NOT NULL,
  `department` varchar(128) COLLATE utf8mb4_bin NOT NULL,
  `hiredate` date NOT NULL,
  PRIMARY KEY (`id`),
  CONSTRAINT `f_to_p_3` FOREIGN KEY (`id`) REFERENCES `people_three` (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_bin;

CREATE TABLE `student_three` (
  `id` varchar(32) COLLATE utf8mb4_bin NOT NULL,
  `school` varchar(12) COLLATE utf8mb4_bin NOT NULL,
  `credits` int(11) NOT NULL,
  PRIMARY KEY (`id`),
  CONSTRAINT `s_to_p_3` FOREIGN KEY (`id`) REFERENCES `people_three` (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_bin;

```

- Sample the data


- __People__

In [2]:
%sql select * from people_three limit 10;

 * mysql+pymysql://dbuser:***@localhost/W4111
10 rows affected.

[('00-0278046', 'Aurlie', 'Colum', 'acolumny@home.pl'),
 ('00-1121299', 'Gertrudis', 'Halgarth', 'ghalgarthlk@google.com.au'),
 ('00-1239907', 'Malinde', 'Doggerell', 'mdoggerellfd@webeden.co.uk'),
 ('00-1867319', 'Far', 'Ixor', 'fixorgi@bluehost.com'),
 ('00-2017224', 'Chelsea', 'Germann', 'cgermann95@netscape.com'),
 ('00-2376480', 'Joyan', 'Dollimore', 'jdollimored8@ustream.tv'),
 ('00-2815610', 'Isaiah', 'Oldrey', 'ioldreyqr@forbes.com'),
 ('00-3031363', 'Jeanelle', 'Axelbey', 'jaxelbey5d@yale.edu'),
 ('00-4130892', 'Lilla', 'Hargreave', 'lhargreave92@liveinternet.ru'),
 ('00-4345209', 'Jefferson', 'Rivett', 'jrivettiw@yahoo.com')]

__Student__

In [3]:
%sql select * from student_three limit 10;

 * mysql+pymysql://dbuser:***@localhost/W4111
10 rows affected.

[('00-1239907', 'GS', 213),
 ('00-2017224', 'GS', 57),
 ('00-2376480', 'GS', 141),
 ('00-2815610', 'GS', 149),
 ('00-3031363', 'GS', 219),
 ('00-4345209', 'SEAS', 204),
 ('00-6299464', 'CC', 31),
 ('00-6351745', 'SEAS', 196),
 ('00-8262493', 'GS', 65),
 ('00-8462453', 'SIPA', 145)]

- OK, well that is only _part of a student._


- We need a view to make the whole thing.

In [6]:
%%sql
create view student_three_view as
    select
        *
    from
        people_three join student_three
        using(id)

 * mysql+pymysql://dbuser:***@localhost/W4111
0 rows affected.

[]

In [7]:
%sql select * from student_three_view limit 10;

 * mysql+pymysql://dbuser:***@localhost/W4111
10 rows affected.

[('00-1239907', 'Malinde', 'Doggerell', 'mdoggerellfd@webeden.co.uk', 'GS', 213),
 ('00-2017224', 'Chelsea', 'Germann', 'cgermann95@netscape.com', 'GS', 57),
 ('00-2376480', 'Joyan', 'Dollimore', 'jdollimored8@ustream.tv', 'GS', 141),
 ('00-2815610', 'Isaiah', 'Oldrey', 'ioldreyqr@forbes.com', 'GS', 149),
 ('00-3031363', 'Jeanelle', 'Axelbey', 'jaxelbey5d@yale.edu', 'GS', 219),
 ('00-4345209', 'Jefferson', 'Rivett', 'jrivettiw@yahoo.com', 'SEAS', 204),
 ('00-6299464', 'Emily', 'Kiehnlt', 'ekiehnltmf@skype.com', 'CC', 31),
 ('00-6351745', 'Alaine', 'Knevett', 'aknevett3o@vinaora.com', 'SEAS', 196),
 ('00-8262493', 'Alphard', 'De Malchar', 'ademalcharcv@omniture.com', 'GS', 65),
 ('00-8462453', 'Quintin', 'Koppen', 'qkoppenbv@unicef.org', 'SIPA', 145)]

__Faculty__ Have to do the same.

In [8]:
%%sql
create view faculty_three_view as
    select
        *
    from
        people_three join student_three
        using(id)

 * mysql+pymysql://dbuser:***@localhost/W4111
0 rows affected.

[]

In [9]:
%sql select * from faculty_three_view limit 10;

 * mysql+pymysql://dbuser:***@localhost/W4111
10 rows affected.

[('00-1239907', 'Malinde', 'Doggerell', 'mdoggerellfd@webeden.co.uk', 'GS', 213),
 ('00-2017224', 'Chelsea', 'Germann', 'cgermann95@netscape.com', 'GS', 57),
 ('00-2376480', 'Joyan', 'Dollimore', 'jdollimored8@ustream.tv', 'GS', 141),
 ('00-2815610', 'Isaiah', 'Oldrey', 'ioldreyqr@forbes.com', 'GS', 149),
 ('00-3031363', 'Jeanelle', 'Axelbey', 'jaxelbey5d@yale.edu', 'GS', 219),
 ('00-4345209', 'Jefferson', 'Rivett', 'jrivettiw@yahoo.com', 'SEAS', 204),
 ('00-6299464', 'Emily', 'Kiehnlt', 'ekiehnltmf@skype.com', 'CC', 31),
 ('00-6351745', 'Alaine', 'Knevett', 'aknevett3o@vinaora.com', 'SEAS', 196),
 ('00-8262493', 'Alphard', 'De Malchar', 'ademalcharcv@omniture.com', 'GS', 65),
 ('00-8462453', 'Quintin', 'Koppen', 'qkoppenbv@unicef.org', 'SIPA', 145)]

## Issues $-$ People is Abstract

- You cannot create a People/Person. ```people``` is an abstract concept and the only "real" things are ```students``` and ```faculty```. 


- How can you prevent people from accidentally inserting a ```people``` 


__Technique 1: Trigger__

In [116]:
%%sql

DROP TRIGGER IF EXISTS `W4111`.`people_three_BEFORE_INSERT`;


USE `W4111`;
CREATE DEFINER = CURRENT_USER TRIGGER `W4111`.`people_three_BEFORE_INSERT`
	BEFORE INSERT ON `people_three` FOR EACH ROW
BEGIN

	signal sqlstate '51001'
		set message_text = 'People is abstract. You can only insert into students or faculty';

END;

 * mysql+pymysql://dbuser:***@localhost/W4111
0 rows affected.
0 rows affected.
0 rows affected.

[]

- But,
    - ```students``` and ```faculty``` have a foreign key constraint on ```people.```
    - You have to have an entry in ```people``` to create a ```student``` or ```faculty.```
    - Which means that you cannot create ```student``` or ```faculty.```


- So, clearly this is not the right approach.

In [13]:
%sql DROP TRIGGER IF EXISTS `W4111`.`people_three_BEFORE_INSERT`;

 * mysql+pymysql://dbuser:***@localhost/W4111
0 rows affected.

[]

__Technique 2: Authorization__

- "__Authorization__ is a security mechanism used to determine user/client privileges or access levels related to system resources, including computer programs, files, services, data and application features. Authorization is normally preceded by authentication for user identity verification." (https://www.techopedia.com/definition/10237/authorization)

- "__Authorization__ is the function of specifying access rights/privileges to resources, which is related to information security and computer security in general and to access control in particular.[1] More formally, "to authorize" is to define an access policy. For example, human resources staff are normally authorized to access employee records and this policy is usually formalized as access control rules in a computer system. During operation, the system uses the access control rules to decide whether access requests from (authenticated) consumers shall be approved (granted) or disapproved (rejected). (https://en.wikipedia.org/wiki/Authorization)


- Authorization requires __authentication.__


- "__Authentication__ ... ... is the act of proving an assertion, such as the identity of a computer system user. In contrast with identification, the act of indicating a person or thing's identity, authentication is the process of verifying that identity. It might involve validating personal identity documents, verifying the authenticity of a website with a digital certificate,[1] determining the age of an artifact by carbon dating, or ensuring that a product or document is not counterfeit." (https://en.wikipedia.org/wiki/Authentication)


- __Authentication:__ "The process of identifying an individual, usually based on a username and password. In security systems, authentication is distinct from authorization , which is the process of giving individuals access to system objects based on their identity. Authentication merely ensures that the individual is who he or she claims to be, but says nothing about the access rights of the individual."(https://www.webopedia.com/TERM/A/authentication.html)


- You have to _authenticate_ to the database when you connect, just like logging onto an application (e.g. SSOL, CourseWorks, ...) The simplest, default and weakest approach is _user ID, password._


- In the databases we are using, there is a table of users.

In [14]:
%sql select * from mysql.user;

 * mysql+pymysql://dbuser:***@localhost/W4111
5 rows affected.

[('%', 'dbuser', 'Y', 'Y', 'Y', 'Y', 'Y', 'Y', 'Y', 'Y', 'Y', 'Y', 'Y', 'Y', 'Y', 'Y', 'Y', 'Y', 'Y', 'Y', 'Y', 'Y', 'Y', 'Y', 'Y', 'Y', 'Y', 'Y', 'Y', 'Y', 'Y', '', b'', b'', b'', 0, 0, 0, 0, 'mysql_native_password', '*5F9114C7BDF19C3506AB4F79EE12BAB0AFB99A90', 'N', datetime.datetime(2020, 1, 13, 15, 17, 6), None, 'N', 'Y', 'Y', None, None, None, None),
 ('localhost', 'mysql.infoschema', 'Y', 'N', 'N', 'N', 'N', 'N', 'N', 'N', 'N', 'N', 'N', 'N', 'N', 'N', 'N', 'N', 'N', 'N', 'N', 'N', 'N', 'N', 'N', 'N', 'N', 'N', 'N', 'N', 'N', '', b'', b'', b'', 0, 0, 0, 0, 'caching_sha2_password', '$A$005$THISISACOMBINATIONOFINVALIDSALTANDPASSWORDTHATMUSTNEVERBRBEUSED', 'N', datetime.datetime(2020, 1, 10, 9, 22, 48), None, 'Y', 'N', 'N', None, None, None, None),
 ('localhost', 'mysql.session', 'N', 'N', 'N', 'N', 'N', 'N', 'N', 'Y', 'N', 'N', 'N', 'N', 'N', 'N', 'N', 'Y', 'N', 'N', 'N', 'N', 'N', 'N', 'N', 'N', 'N', 'N', 'N', 'N', 'N', '', b'', b'', b'', 0, 0, 0, 0, 'caching_sha2_password', '$A$005$THISISACOMBINATIONOFINVALIDSALTANDPASSWORDTHATMUSTNEVERBRBEUSED', 'N', datetime.datetime(2020, 1, 10, 9, 22, 48), None, 'Y', 'N', 'N', None, None, None, None),
 ('localhost', 'mysql.sys', 'N', 'N', 'N', 'N', 'N', 'N', 'N', 'N', 'N', 'N', 'N', 'N', 'N', 'N', 'N', 'N', 'N', 'N', 'N', 'N', 'N', 'N', 'N', 'N', 'N', 'N', 'N', 'N', 'N', '', b'', b'', b'', 0, 0, 0, 0, 'caching_sha2_password', '$A$005$THISISACOMBINATIONOFINVALIDSALTANDPASSWORDTHATMUSTNEVERBRBEUSED', 'N', datetime.datetime(2020, 1, 10, 9, 22, 48), None, 'Y', 'N', 'N', None, None, None, None),
 ('localhost', 'root', 'Y', 'Y', 'Y', 'Y', 'Y', 'Y', 'Y', 'Y', 'Y', 'Y', 'Y', 'Y', 'Y', 'Y', 'Y', 'Y', 'Y', 'Y', 'Y', 'Y', 'Y', 'Y', 'Y', 'Y', 'Y', 'Y', 'Y', 'Y', 'Y', '', b'', b'', b'', 0, 0, 0, 0, 'mysql_native_password', '*5F9114C7BDF19C3506AB4F79EE12BAB0AFB99A90', 'N', datetime.datetime(2020, 1, 10, 9, 22, 50), None, 'N', 'Y', 'Y', None, None, None, None)]

In [15]:
%sql select host, user, plugin, authentication_string from mysql.user;

 * mysql+pymysql://dbuser:***@localhost/W4111
5 rows affected.

[('%', 'dbuser', 'mysql_native_password', '*5F9114C7BDF19C3506AB4F79EE12BAB0AFB99A90'),
 ('localhost', 'mysql.infoschema', 'caching_sha2_password', '$A$005$THISISACOMBINATIONOFINVALIDSALTANDPASSWORDTHATMUSTNEVERBRBEUSED'),
 ('localhost', 'mysql.session', 'caching_sha2_password', '$A$005$THISISACOMBINATIONOFINVALIDSALTANDPASSWORDTHATMUSTNEVERBRBEUSED'),
 ('localhost', 'mysql.sys', 'caching_sha2_password', '$A$005$THISISACOMBINATIONOFINVALIDSALTANDPASSWORDTHATMUSTNEVERBRBEUSED'),
 ('localhost', 'root', 'mysql_native_password', '*5F9114C7BDF19C3506AB4F79EE12BAB0AFB99A90')]

- Wait! I thought that ```dbuser```'s password was ```dbuserdbuser.```


- Security systems do not save the password. They save a one-way hash of the password.
    - If you have the password, you can hash and check if it matches the hash.
    - If you have the hashed value, you cannot get the password.
    - To login, you must have the original password, not the hashed value.
    
    
- What is this "plug-in" stuff?

| <img src="./Lecture_6_Relational_SQL_Pattern_80.jpg"> |
| :---: |
| __Authentication (Simplistic Explanation)__ |

- We are going to allow advanced users (```root, dbuser```) to do insert, because they "know what they are doing." Normal users cannot do the insert.

In [19]:
%%sql

CREATE USER 'normaluser'@'localhost' IDENTIFIED BY 'normalusernormaluser';

 * mysql+pymysql://dbuser:***@localhost/W4111
0 rows affected.

[]

- What can this user do?

In [99]:
import pymysql
normal_conn = pymysql.connect(
    host='localhost',
    user='normaluser',
    password='normalusernormaluser',
    cursorclass=pymysql.cursors.DictCursor)

In [100]:
normal_cursor = normal_conn.cursor()
res = normal_cursor.execute("show databases")
d = normal_cursor.fetchall()
d

[{'Database': 'information_schema'}]

- The ```normaluser``` can only see the existence of the "catalog" of schema information. We will cover this database later.

In [101]:
try:
    res = normal_cursor.execute("show tables from W4111")
    d = normal_cursor.fetchall()
    print("The tables in W4111 are: ", d)
except Exception as e:
    print("What happened when a normal user tried to access the tables?")
    print(e)

The tables in W4111 are:  ()

- Well, we can allow ```normaluser``` to query the views. __Remember__ that for ```%sql,``` I am logged on as a administrative user.

In [104]:
%%sql

GRANT SELECT ON W4111.student_three_view TO 'normaluser'@'localhost';
GRANT SELECT ON W4111.faculty_three_view TO 'normaluser'@'localhost';
GRANT SELECT ON W4111.people_three TO 'normaluser'@'localhost';

 * mysql+pymysql://dbuser:***@localhost/W4111
0 rows affected.
0 rows affected.
0 rows affected.

[]

In [106]:
%sql select * from student_three_view limit 10;

 * mysql+pymysql://dbuser:***@localhost/W4111
10 rows affected.

[('00-1239907', 'Malinde', 'Doggerell', 'mdoggerellfd@webeden.co.uk', 'GS', 213),
 ('00-2017224', 'Chelsea', 'Germann', 'cgermann95@netscape.com', 'GS', 57),
 ('00-2376480', 'Joyan', 'Dollimore', 'jdollimored8@ustream.tv', 'GS', 141),
 ('00-2815610', 'Isaiah', 'Oldrey', 'ioldreyqr@forbes.com', 'GS', 149),
 ('00-3031363', 'Jeanelle', 'Axelbey', 'jaxelbey5d@yale.edu', 'GS', 219),
 ('00-4345209', 'Jefferson', 'Rivett', 'jrivettiw@yahoo.com', 'SEAS', 204),
 ('00-6299464', 'Emily', 'Kiehnlt', 'ekiehnltmf@skype.com', 'CC', 31),
 ('00-6351745', 'Alaine', 'Knevett', 'aknevett3o@vinaora.com', 'SEAS', 196),
 ('00-8262493', 'Alphard', 'De Malchar', 'ademalcharcv@omniture.com', 'GS', 65),
 ('00-8462453', 'Quintin', 'Koppen', 'qkoppenbv@unicef.org', 'SIPA', 145)]

- But, the dude cannot cause any damage!

In [37]:
sql = """
insert into W4111.people_three 
    values('99-0278046', 'Mickey', 'Mouse', 'mm@disney.com'
)"""

try:
    res = normal_cursor.execute(sql)
    print("The insert returned: ", d)
except Exception as e:
    print("What happened when a normal user tried to access the tables?")
    print(e)

What happened when a normal user tried to access the tables?
(1142, "INSERT command denied to user 'normaluser'@'localhost' for table 'people_three'")

- Now, if you remember, under some circumstances you can "modify through a view." Let's let the user insert into ```student_three_view``` and ```faculty_three_view.```

In [107]:
%%sql

GRANT insert ON W4111.student_three_view TO 'normaluser'@'localhost';
GRANT insert ON W4111.faculty_three_view TO 'normaluser'@'localhost';

 * mysql+pymysql://dbuser:***@localhost/W4111
0 rows affected.
0 rows affected.

[]

- And try to do an INSERT into ```students_three_view.```

In [41]:
sql = """
insert into W4111.student_three_view(id, first_name, last_name, email, school, credits)
    values('99-2376480', 'Mouse', 'Mickey', 'mm@disney.com', 'GS', '100')
"""
try:
    res = normal_cursor.execute(sql)
    print("The insert returned: ", d)
except Exception as e:
    print("What happened when a normal user tried to access the tables?")
    print(e)

What happened when a normal user tried to access the tables?
(1393, "Can not modify more than one base table through a join view 'w4111.student_three_view'")

- Dang. This is apparently one of those times when you cannot update/insert through a view.

- But, ```root``` and ```dbuser``` CAN do the inserts. Does this help us in any way?

- Yes
    - ```root``` creates a procedure that implements some capability.
    - The procedure runs with the security of the ```DEFINER.```
    - ```root``` grants execute access on the procedure to ```normaluser.```

In [108]:
%%sql

USE `W4111`;
DROP procedure IF EXISTS `create_student_three`;

USE `W4111`;
CREATE PROCEDURE `create_student_three` (
	id VARCHAR(32), first_name VARCHAR(64), last_name VARCHAR(64), email VARCHAR(128),
    school VARCHAR(12), credits INT)
SQL SECURITY DEFINER
BEGIN

	INSERT INTO people_three VALUES (id, first_name, last_name, email);
    INSERT INTO students_three VALUES(id, school, credits);
    
END

 * mysql+pymysql://dbuser:***@localhost/W4111
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.

[]

In [109]:
%%sql
GRANT execute ON PROCEDURE W4111.create_student_three TO 'normaluser'@'localhost';

 * mysql+pymysql://dbuser:***@localhost/W4111
0 rows affected.

[]

In [110]:
%sql select * from people_three where last_name='Ferguson'

 * mysql+pymysql://dbuser:***@localhost/W4111
1 rows affected.

[('102', 'Donald', 'Ferguson', 'dff9@columbia.edu')]

In [95]:
normal_cursor = normal_conn.cursor()
sql = """
call W4111.create_student_three('102', 'Donald', 'Ferguson', 'dff9@columbia.edu', 'CC', 132);
"""
try:
    res = normal_cursor.execute(sql)
    print("The insert returned: ", res)
except Exception as e:
    print("What happened when a normal user tried to access the tables?")
    print(e)

The insert returned:  1

In [114]:
%sql select * from W4111.student_three_view where last_name='Ferguson'

 * mysql+pymysql://dbuser:***@localhost/W4111
1 rows affected.

[('102', 'Donald', 'Ferguson', 'dff9@columbia.edu', 'CC', 132)]

## Summary

- What did we do, or start to do?